#+TITLE: Cowsay tests

* 1. Define Example

Define runnable examples with source-code block.

#+NAME: test-cowsay
#+begin_src shell :results output
nix run nixpkgs#cowsay -- "Hello"
#+end_src

#+RESULTS: test-cowsay
:  _______
: < Hello >
:  -------
:         \   ^__^
:          \  (oo)\_______
:             (__)\       )\/\
:                 ||----w |
:                 ||     ||

* 2. Write down expectations

#+NAME: expect-cowsay-including
#+begin_example
Hello
#+end_example

#+NAME: expect-cowsay-exact
#+begin_example
< Hello >
 ----
        \   ^__^
         \  (oo)\_______
            (__)\       )\/\
                ||----w |
                ||     ||

#+end_example

* 절차

1. 먼저 버퍼에서 테스트를 찾는다.

   #+begin_src elisp
   (org-test--find-tests)
   #+end_src

   #+RESULTS:
   | src-block | (:standard-properties [95 115 nil nil 193 1 nil nil nil nil nil nil nil nil cowsay.org nil nil (section (:standard-properties [45 45 45 384 384 0 nil section nil nil nil 45 384 nil cowsay.org nil nil (headline (:standard-properties [24 24 45 384 384 0 (:title) nil nil nil nil 47 382 1 cowsay.org nil nil (org-data (:standard-properties [1 1 1 769 769 0 nil org-data nil nil nil 3 769 nil cowsay.org nil nil nil] :path /Users/nyeong/Repos/org-test/tests/cowsay.org :CATEGORY cowsay) (section (:standard-properties [1 1 1 24 24 0 nil first-section nil nil nil 1 24 nil cowsay.org nil nil #8]) (keyword (:standard-properties [1 1 nil nil 24 1 nil top-comment nil nil nil nil nil nil cowsay.org nil nil #9] :key TITLE :value Cowsay tests))) #5 (headline (:standard-properties [384 384 414 682 682 0 (:title) nil nil nil nil 416 680 1 cowsay.org nil nil #8] :pre-blank 1 :raw-value 2. Write down expectations :title (2. Write down expectations) :level 1 :priority nil :tags nil :todo-keyword nil :todo-type nil :footnote-section-p nil :archivedp nil :commentedp nil) (section (:standard-properties [414 414 414 682 682 0 nil section nil nil nil 414 682 nil cowsay.org nil nil #9]) (example-block (:standard-properties [414 446 nil nil 483 1 nil planning nil nil nil nil nil nil cowsay.org nil nil #10] :value Hello |

2. expectation도 찾는다

   #+begin_src elisp
   (org-test--find-expectations)
   #+end_src

   #+RESULTS:
   #+begin_example
   #s(hash-table test equal data ("cowsay" ((example-block (:standard-properties [483 511 nil nil 682 1 nil nil nil nil nil nil nil nil #<buffer cowsay.org> nil nil (section (:standard-properties [414 414 414 682 682 0 nil section nil nil nil 414 682 nil #<buffer cowsay.org> nil nil (headline (:standard-properties [384 384 414 682 682 0 (:title) nil nil nil nil 416 680 1 #<buffer cowsay.org> nil nil (org-data (:standard-properties [1 1 1 2203 2203 0 nil org-data nil nil nil 3 2203 nil #<buffer cowsay.org> nil nil nil] :path "/Users/nyeong/Repos/org-test/tests/cowsay.org" :CATEGORY "cowsay") (section (:standard-properties [1 1 1 24 24 0 nil first-section nil nil nil 1 24 nil #<buffer cowsay.org> nil nil #11]) (keyword (:standard-properties [1 1 nil nil 24 1 nil top-comment nil nil nil nil nil nil #<buffer cowsay.org> nil nil #12] :key "TITLE" :value "Cowsay tests"))) (headline (:standard-properties [24 24 45 384 384 0 (:title) nil nil nil nil 47 382 1 #<buffer cowsay.org> nil nil #11] :pre-blank 1 :raw-value "1. Define Example" :title (#("1. Define Example" 0 17 (:parent #12))) :level 1 :priority nil :tags nil :todo-keyword nil :todo-type nil :footnote-section-p nil :archivedp nil :commentedp nil) (section (:standard-properties [45 45 45 384 384 0 nil section nil nil nil 45 384 nil #<buffer cowsay.org> nil nil #12]) (paragraph (:standard-properties [45 45 45 94 95 1 nil planning nil nil nil nil nil nil #<buffer cowsay.org> nil nil #13]) #("Define runnable examples with source-code block.
   " 0 49 (:parent #14))) (src-block (:standard-properties [95 115 nil nil 193 1 nil nil nil nil nil nil nil nil #<buffer cowsay.org> nil nil #13] :language "bash" :switches nil :parameters ":results output" :number-lines nil :preserve-indent nil :retain-labels t :use-labels t :label-fmt nil :value "nix run nixpkgs#cowsay -- \"Hello\"
   " :name "test-cowsay")) (fixed-width (:standard-properties [193 216 nil nil 384 2 nil nil nil nil nil nil nil nil #<buffer cowsay.org> nil nil #13] :value " _______
   < Hello >
    -------
           \\   ^__^
            \\  (oo)\\_______
               (__)\\       )\\/\\
                   ||----w |
                   ||     ||" :results ("test-cowsay"))))) #8 (headline (:standard-properties [682 682 688 2203 2203 0 (:title) nil nil nil nil 690 2201 1 #<buffer cowsay.org> nil nil #11] :pre-blank 1 :raw-value "절차" :title (#("절차" 0 2 (:parent #12))) :level 1 :priority nil :tags nil :todo-keyword nil :todo-type nil :footnote-section-p nil :archivedp nil :commentedp nil) (section (:standard-properties [688 688 688 2203 2203 0 nil section nil nil nil 688 2203 nil #<buffer cowsay.org> nil nil #12]) (plain-list (:standard-properties [688 688 688 2203 2203 0 nil planning nil nil nil nil nil nil #<buffer cowsay.org> nil ((688 0 "1. " nil nil nil 2116) (2116 0 "1. " nil nil nil 2203)) #13] :type ordered) (item (:standard-properties [688 688 691 2115 2116 1 (:tag) item nil nil nil nil nil nil #<buffer cowsay.org> nil ((688 0 "1. " nil nil nil 2116) (2116 0 "1. " nil nil nil 2203)) #14] :bullet "1. " :checkbox nil :counter nil :pre-blank 0 :tag nil) (paragraph (:standard-properties [691 691 691 709 710 1 nil nil nil nil nil nil nil nil #<buffer cowsay.org> nil nil #15]) #("먼저 버퍼에서 테스트를 찾는다.
   " 0 18 (:parent #16))) (src-block (:standard-properties [710 710 nil nil 771 1 nil nil nil nil nil nil nil nil #<buffer cowsay.org> nil nil #15] :language "elisp" :switches nil :parameters nil :number-lines nil :preserve-indent nil :retain-labels t :use-labels t :label-fmt nil :value "   (org-test--find-tests)
   ")) (table (:standard-properties [771 785 785 2115 2115 0 nil nil nil nil nil nil nil nil #<buffer cowsay.org> nil nil #15] :type org :tblfm nil :value nil :results ("")) (table-row (:standard-properties [785 785 789 2114 2115 0 nil table-row nil nil nil nil nil nil #<buffer cowsay.org> nil nil #16] :type standard) (table-cell (:standard-properties [789 nil 790 799 801 0 nil nil nil nil nil nil nil nil #<buffer cowsay.org> nil nil #17]) #("src-block" 0 9 (:parent #18))) (table-cell (:standard-properties [801 nil 802 2112 2114 0 nil nil nil nil nil nil nil nil #<buffer cowsay.org> nil nil #17]) #("(:standard-properties [95 115 nil nil 193 1 nil nil nil nil nil nil nil nil cowsay.org nil nil (section (:standard-properties [45 45 45 384 384 0 nil section nil nil nil 45 384 nil cowsay.org nil nil (headline (:standard-properties [24 24 45 384 384 0 (:title) nil nil nil nil 47 382 1 cowsay.org nil nil (org-data (:standard-properties [1 1 1 769 769 0 nil org-data nil nil nil 3 769 nil cowsay.org nil nil nil] :path /Users/nyeong/Repos/org-test/tests/cowsay.org :CATEGORY cowsay) (section (:standard-properties [1 1 1 24 24 0 nil first-section nil nil nil 1 24 nil cowsay.org nil nil #8]) (keyword (:standard-properties [1 1 nil nil 24 1 nil top-comment nil nil nil nil nil nil cowsay.org nil nil #9] :key TITLE :value Cowsay tests))) #5 (headline (:standard-properties [384 384 414 682 682 0 (:title) nil nil nil nil 416 680 1 cowsay.org nil nil #8] :pre-blank 1 :raw-value 2. Write down expectations :title (2. Write down expectations) :level 1 :priority nil :tags nil :todo-keyword nil :todo-type nil :footnote-section-p nil :archivedp nil :commentedp nil) (section (:standard-properties [414 414 414 682 682 0 nil section nil nil nil 414 682 nil cowsay.org nil nil #9]) (example-block (:standard-properties [414 446 nil nil 483 1 nil planning nil nil nil nil nil nil cowsay.org nil nil #10] :value Hello" 0 1310 (:parent #18)))))) (item (:standard-properties [2116 2116 2119 2203 2203 0 (:tag) item nil nil nil nil nil nil #<buffer cowsay.org> nil ((688 0 "1. " nil nil nil 2116) (2116 0 "1. " nil nil nil 2203)) #14] :bullet "1. " :checkbox nil :counter nil :pre-blank 0 :tag nil) (paragraph (:standard-properties [2119 2119 2119 2136 2137 1 nil nil nil nil nil nil nil nil #<buffer cowsay.org> nil nil #15]) #("expectation도 찾는다
   " 0 17 (:parent #16))) (src-block (:standard-properties [2137 2137 nil nil 2203 0 nil nil nil nil nil nil nil nil #<buffer cowsay.org> nil nil #15] :language "elisp" :switches nil :parameters nil :number-lines nil :preserve-indent nil :retain-labels t :use-labels t :label-fmt nil :value "   (org-test--find-expectations)
   ")))))))] :pre-blank 1 :raw-value "2. Write down expectations" :title (#("2. Write down expectations" 0 26 (:parent #8))) :level 1 :priority nil :tags nil :todo-keyword nil :todo-type nil :footnote-section-p nil :archivedp nil :commentedp nil) #5)]) (example-block (:standard-properties [414 446 nil nil 483 1 nil planning nil nil nil nil nil nil #<buffer cowsay.org> nil nil #5] :value "Hello
   " :switches nil :number-lines nil :preserve-indent nil :retain-labels t :use-labels t :label-fmt nil :name "expect-cowsay-including")) #2)] :value "< Hello >
    ----
           \\   ^__^
            \\  (oo)\\_______
               (__)\\       )\\/\\
                   ||----w |
                   ||     ||

   " :switches nil :number-lines nil :preserve-indent nil :retain-labels t :use-labels t :label-fmt nil :name "expect-cowsay-exact")) (example-block (:standard-properties [414 446 nil nil 483 1 nil planning nil nil nil nil nil nil #<buffer cowsay.org> nil nil (section (:standard-properties [414 414 414 682 682 0 nil section nil nil nil 414 682 nil #<buffer cowsay.org> nil nil (headline (:standard-properties [384 384 414 682 682 0 (:title) nil nil nil nil 416 680 1 #<buffer cowsay.org> nil nil (org-data (:standard-properties [1 1 1 2203 2203 0 nil org-data nil nil nil 3 2203 nil #<buffer cowsay.org> nil nil nil] :path "/Users/nyeong/Repos/org-test/tests/cowsay.org" :CATEGORY "cowsay") (section (:standard-properties [1 1 1 24 24 0 nil first-section nil nil nil 1 24 nil #<buffer cowsay.org> nil nil #11]) (keyword (:standard-properties [1 1 nil nil 24 1 nil top-comment nil nil nil nil nil nil #<buffer cowsay.org> nil nil #12] :key "TITLE" :value "Cowsay tests"))) (headline (:standard-properties [24 24 45 384 384 0 (:title) nil nil nil nil 47 382 1 #<buffer cowsay.org> nil nil #11] :pre-blank 1 :raw-value "1. Define Example" :title (#("1. Define Example" 0 17 (:parent #12))) :level 1 :priority nil :tags nil :todo-keyword nil :todo-type nil :footnote-section-p nil :archivedp nil :commentedp nil) (section (:standard-properties [45 45 45 384 384 0 nil section nil nil nil 45 384 nil #<buffer cowsay.org> nil nil #12]) (paragraph (:standard-properties [45 45 45 94 95 1 nil planning nil nil nil nil nil nil #<buffer cowsay.org> nil nil #13]) #("Define runnable examples with source-code block.
   " 0 49 (:parent #14))) (src-block (:standard-properties [95 115 nil nil 193 1 nil nil nil nil nil nil nil nil #<buffer cowsay.org> nil nil #13] :language "bash" :switches nil :parameters ":results output" :number-lines nil :preserve-indent nil :retain-labels t :use-labels t :label-fmt nil :value "nix run nixpkgs#cowsay -- \"Hello\"
   " :name "test-cowsay")) (fixed-width (:standard-properties [193 216 nil nil 384 2 nil nil nil nil nil nil nil nil #<buffer cowsay.org> nil nil #13] :value " _______
   < Hello >
    -------
           \\   ^__^
            \\  (oo)\\_______
               (__)\\       )\\/\\
                   ||----w |
                   ||     ||" :results ("test-cowsay"))))) #8 (headline (:standard-properties [682 682 688 2203 2203 0 (:title) nil nil nil nil 690 2201 1 #<buffer cowsay.org> nil nil #11] :pre-blank 1 :raw-value "절차" :title (#("절차" 0 2 (:parent #12))) :level 1 :priority nil :tags nil :todo-keyword nil :todo-type nil :footnote-section-p nil :archivedp nil :commentedp nil) (section (:standard-properties [688 688 688 2203 2203 0 nil section nil nil nil 688 2203 nil #<buffer cowsay.org> nil nil #12]) (plain-list (:standard-properties [688 688 688 2203 2203 0 nil planning nil nil nil nil nil nil #<buffer cowsay.org> nil ((688 0 "1. " nil nil nil 2116) (2116 0 "1. " nil nil nil 2203)) #13] :type ordered) (item (:standard-properties [688 688 691 2115 2116 1 (:tag) item nil nil nil nil nil nil #<buffer cowsay.org> nil ((688 0 "1. " nil nil nil 2116) (2116 0 "1. " nil nil nil 2203)) #14] :bullet "1. " :checkbox nil :counter nil :pre-blank 0 :tag nil) (paragraph (:standard-properties [691 691 691 709 710 1 nil nil nil nil nil nil nil nil #<buffer cowsay.org> nil nil #15]) #("먼저 버퍼에서 테스트를 찾는다.
   " 0 18 (:parent #16))) (src-block (:standard-properties [710 710 nil nil 771 1 nil nil nil nil nil nil nil nil #<buffer cowsay.org> nil nil #15] :language "elisp" :switches nil :parameters nil :number-lines nil :preserve-indent nil :retain-labels t :use-labels t :label-fmt nil :value "   (org-test--find-tests)
   ")) (table (:standard-properties [771 785 785 2115 2115 0 nil nil nil nil nil nil nil nil #<buffer cowsay.org> nil nil #15] :type org :tblfm nil :value nil :results ("")) (table-row (:standard-properties [785 785 789 2114 2115 0 nil table-row nil nil nil nil nil nil #<buffer cowsay.org> nil nil #16] :type standard) (table-cell (:standard-properties [789 nil 790 799 801 0 nil nil nil nil nil nil nil nil #<buffer cowsay.org> nil nil #17]) #("src-block" 0 9 (:parent #18))) (table-cell (:standard-properties [801 nil 802 2112 2114 0 nil nil nil nil nil nil nil nil #<buffer cowsay.org> nil nil #17]) #("(:standard-properties [95 115 nil nil 193 1 nil nil nil nil nil nil nil nil cowsay.org nil nil (section (:standard-properties [45 45 45 384 384 0 nil section nil nil nil 45 384 nil cowsay.org nil nil (headline (:standard-properties [24 24 45 384 384 0 (:title) nil nil nil nil 47 382 1 cowsay.org nil nil (org-data (:standard-properties [1 1 1 769 769 0 nil org-data nil nil nil 3 769 nil cowsay.org nil nil nil] :path /Users/nyeong/Repos/org-test/tests/cowsay.org :CATEGORY cowsay) (section (:standard-properties [1 1 1 24 24 0 nil first-section nil nil nil 1 24 nil cowsay.org nil nil #8]) (keyword (:standard-properties [1 1 nil nil 24 1 nil top-comment nil nil nil nil nil nil cowsay.org nil nil #9] :key TITLE :value Cowsay tests))) #5 (headline (:standard-properties [384 384 414 682 682 0 (:title) nil nil nil nil 416 680 1 cowsay.org nil nil #8] :pre-blank 1 :raw-value 2. Write down expectations :title (2. Write down expectations) :level 1 :priority nil :tags nil :todo-keyword nil :todo-type nil :footnote-section-p nil :archivedp nil :commentedp nil) (section (:standard-properties [414 414 414 682 682 0 nil section nil nil nil 414 682 nil cowsay.org nil nil #9]) (example-block (:standard-properties [414 446 nil nil 483 1 nil planning nil nil nil nil nil nil cowsay.org nil nil #10] :value Hello" 0 1310 (:parent #18)))))) (item (:standard-properties [2116 2116 2119 2203 2203 0 (:tag) item nil nil nil nil nil nil #<buffer cowsay.org> nil ((688 0 "1. " nil nil nil 2116) (2116 0 "1. " nil nil nil 2203)) #14] :bullet "1. " :checkbox nil :counter nil :pre-blank 0 :tag nil) (paragraph (:standard-properties [2119 2119 2119 2136 2137 1 nil nil nil nil nil nil nil nil #<buffer cowsay.org> nil nil #15]) #("expectation도 찾는다
   " 0 17 (:parent #16))) (src-block (:standard-properties [2137 2137 nil nil 2203 0 nil nil nil nil nil nil nil nil #<buffer cowsay.org> nil nil #15] :language "elisp" :switches nil :parameters nil :number-lines nil :preserve-indent nil :retain-labels t :use-labels t :label-fmt nil :value "   (org-test--find-expectations)
   ")))))))] :pre-blank 1 :raw-value "2. Write down expectations" :title (#("2. Write down expectations" 0 26 (:parent #8))) :level 1 :priority nil :tags nil :todo-keyword nil :todo-type nil :footnote-section-p nil :archivedp nil :commentedp nil) #5)]) #2 (example-block (:standard-properties [483 511 nil nil 682 1 nil nil nil nil nil nil nil nil #<buffer cowsay.org> nil nil #5] :value "< Hello >
    ----
           \\   ^__^
            \\  (oo)\\_______
               (__)\\       )\\/\\
                   ||----w |
                   ||     ||

   " :switches nil :number-lines nil :preserve-indent nil :retain-labels t :use-labels t :label-fmt nil :name "expect-cowsay-exact")))] :value "Hello
   " :switches nil :number-lines nil :preserve-indent nil :retain-labels t :use-labels t :label-fmt nil :name "expect-cowsay-including")))))
   #+end_example

3. 각 테스트를 실행하고 expectation과 비교한다.

   #+begin_src elisp
  (org-test-run-current-buffer)
   #+end_src

   #+RESULTS:
